# Lecture 15 – Grouping and Pivoting

## Data 6, Summer 2024

In [1]:
from datascience import *
import numpy as np
%matplotlib inline
Table.interactive_plots()

## Grouping with `.group`

The term "group" in data science is most commonly associated with data aggregation and disaggregation. When we "group" a table in Python, we are able to gain insights about our data at a higher unit of analysis (e.g. at a city or state level, as opposed to the individual level).

Returning to the `top_10` dataset from last week (showing the songs on the Spotify Top 10), we can utilize `tbl.group()` to count how many Top 10 songs each artist has.

In [2]:
top_10 = Table.read_table('data/regional-global-daily-latest.csv').take(np.arange(10))
top_10

rank | artist_names                 | track_name                              | source                        | peak_rank | previous_rank | days_on_chart | streams
1    | Kate Bush                    | Running Up That Hill                    | Rhino                         | 1         | 1             | 41            | 7208654
2    | Harry Styles                 | As It Was                               | Columbia                      | 1         | 2             | 99            | 6543793
3    | Joji                         | Glimpse of Us                           | 88rising Music/Warner Records | 1         | 3             | 28            | 5492997
4    | Bad Bunny, Chencho Corleone  | Me Porto Bonito                         | Rimas Entertainment LLC       | 2         | 4             | 63            | 5416421
5    | Bizarrap, Quevedo            | Quevedo: Bzrp Music Sessions, Vol. 52   | DALE PLAY Records             | 5         | -1            | 1             | 4676471
6    | Bad Bunny                    | Tití Me Preguntó                        | Rimas Entertainment LLC       | 4         | 5             | 63            | 4549682
7    | Bad Bunny, Bomba Estéreo     | Ojitos Lindos                           | Rimas Entertainment LLC       | 2         | 6             | 63            | 4144625
8    | Bad Bunny                    | Efecto                                  | Rimas Entertainment LLC       | 7         | 8             | 63            | 3722317
9    | Charlie Puth, BTS, Jung Kook | Left and Right (Feat. Jung Kook of BTS) | Atlantic Records              | 3         | 7             | 14            | 3715689
10   | Bad Bunny                    | Moscow Mule                             | Rimas Entertainment LLC       | 1         | 9             | 63            | 3465003

By default `tbl.group(column)` counts the number of occurences of each unique value in `column`.

In [3]:
top_10.group('artist_names').sort('count', descending=True)

artist_names                 | count
Bad Bunny                    | 3
Bad Bunny, Bomba Estéreo     | 1
Bad Bunny, Chencho Corleone  | 1
Bizarrap, Quevedo            | 1
Charlie Puth, BTS, Jung Kook | 1
Harry Styles                 | 1
Joji                         | 1
Kate Bush                    | 1

Notice that Bad Bunny's name appears 5 times on the Top 10, but the "Bad Bunny" row in the groupped table only has a count of 3. This is because Python looks for an **exact match**. The songs where Bad Bunny appears along with other artists are counted separately.

### Quick Check 1

In [4]:
streams = Table.read_table('data/regional-global-daily-latest.csv')
streams

rank | artist_names                 | track_name                              | source                        | peak_rank | previous_rank | days_on_chart | streams
1    | Kate Bush                    | Running Up That Hill                    | Rhino                         | 1         | 1             | 41            | 7208654
2    | Harry Styles                 | As It Was                               | Columbia                      | 1         | 2             | 99            | 6543793
3    | Joji                         | Glimpse of Us                           | 88rising Music/Warner Records | 1         | 3             | 28            | 5492997
4    | Bad Bunny, Chencho Corleone  | Me Porto Bonito                         | Rimas Entertainment LLC       | 2         | 4             | 63            | 5416421
5    | Bizarrap, Quevedo            | Quevedo: Bzrp Music Sessions, Vol. 52   | DALE PLAY Records             | 5         | -1            | 1             | 4676471
6    | Bad Bunny                    | Tití Me Preguntó                        | Rimas Entertainment LLC       | 4         | 5             | 63            | 4549682
7    | Bad Bunny, Bomba Estéreo     | Ojitos Lindos                           | Rimas Entertainment LLC       | 2         | 6             | 63            | 4144625
8    | Bad Bunny                    | Efecto                                  | Rimas Entertainment LLC       | 7         | 8             | 63            | 3722317
9    | Charlie Puth, BTS, Jung Kook | Left and Right (Feat. Jung Kook of BTS) | Atlantic Records              | 3         | 7             | 14            | 3715689
10   | Bad Bunny                    | Moscow Mule                             | Rimas Entertainment LLC       | 1         | 9             | 63            | 3465003
... (190 rows omitted)

Using the `streams` table, fill in the blanks to create the “Top 10 Artists” bar chart: The 10 artists with the most songs in the Spotify Daily Top 200 streams table.

In [6]:
top_10_artists = streams.group("artist_names").sort("count", descending=True).take(np.arange(10))
top_10_artists

artist_names    | count
Bad Bunny       | 16
Harry Styles    | 8
Olivia Rodrigo  | 5
The Weeknd      | 5
Ed Sheeran      | 4
Arctic Monkeys  | 3
BTS             | 3
Doja Cat        | 3
Eminem          | 3
Imagine Dragons | 3

## Advanced Grouping

For the rest of today's lecture, we will use the `cars` table, which contains specifications for a variety of car models.

In [7]:
cars = Table.read_table('data/models-2021.csv')
cars

Manufacturer | Brand | Model                   | Displacement | Cylinders | MPG  | Wheel
BMW          | BMW   | 228i Gran Coupe         | 2            | 4         | 28   | 2-Wheel Drive, Front
BMW          | BMW   | 228i xDrive Gran Coupe  | 2            | 4         | 27   | All Wheel Drive
BMW          | BMW   | 230i Convertible        | 2            | 4         | 27   | 2-Wheel Drive, Rear
BMW          | BMW   | 230i Coupe              | 2            | 4         | 28   | 2-Wheel Drive, Rear
BMW          | BMW   | 230i xDrive Convertible | 2            | 4         | 24   | All Wheel Drive
BMW          | BMW   | 230i xDrive Coupe       | 2            | 4         | 24   | All Wheel Drive
BMW          | BMW   | 330i                    | 2            | 4         | 30   | 2-Wheel Drive, Rear
BMW          | BMW   | 330i xDrive             | 2            | 4         | 28   | All Wheel Drive
BMW          | BMW   | 430i Coupe              | 2            | 4         | 29   | 2-Wheel Drive, Rear
BMW          | BMW   | 430i xDrive Coupe       | 2            | 4         | 27   | All Wheel Drive
... (764 rows omitted)

A few notes:
* `Manufacturer` is who owns the Brand.
    * GM owns Buick, Cadillac, Chevrolet, GMC.
* `Displacement` is the engine size in liters.
* `MPG` is miles per gallon.

Here we'll take a subset of the rows and columns for illustration.

In [8]:
gm = (
        cars.where('Manufacturer', 'General Motors')
            .select('Brand', 'Model', 'Cylinders', 'MPG')
            .take([0, 1, 9, 16, 20, 30, 31, 35, -1])
            .take([1, 2, 4, 8, 5, 6, 3, 7, 0])
    )
gm

Brand     | Model        | Cylinders | MPG
Buick     | ENCLAVE FWD  | 6         | 21
Cadillac  | CT4 AWD      | 4         | 26
Cadillac  | XT5 AWD      | 4         | 23
GMC       | YUKON XL 4WD | 6         | 22
Chevrolet | CAMARO       | 4         | 25
Chevrolet | COLORADO 2WD | 4         | 22
Cadillac  | ESCALADE 2WD | 6         | 23
Chevrolet | EQUINOX AWD  | 4         | 27
Buick     | ENCLAVE AWD  | 6         | 20

### Default Behavior

In [9]:
gm.group('Brand')

Brand     | count
Buick     | 2
Cadillac  | 3
Chevrolet | 3
GMC       | 1

In [10]:
gm.group('Cylinders')

Cylinders | count
4         | 5
6         | 4

In [11]:
cars

Manufacturer | Brand | Model                   | Displacement | Cylinders | MPG  | Wheel
BMW          | BMW   | 228i Gran Coupe         | 2            | 4         | 28   | 2-Wheel Drive, Front
BMW          | BMW   | 228i xDrive Gran Coupe  | 2            | 4         | 27   | All Wheel Drive
BMW          | BMW   | 230i Convertible        | 2            | 4         | 27   | 2-Wheel Drive, Rear
BMW          | BMW   | 230i Coupe              | 2            | 4         | 28   | 2-Wheel Drive, Rear
BMW          | BMW   | 230i xDrive Convertible | 2            | 4         | 24   | All Wheel Drive
BMW          | BMW   | 230i xDrive Coupe       | 2            | 4         | 24   | All Wheel Drive
BMW          | BMW   | 330i                    | 2            | 4         | 30   | 2-Wheel Drive, Rear
BMW          | BMW   | 330i xDrive             | 2            | 4         | 28   | All Wheel Drive
BMW          | BMW   | 430i Coupe              | 2            | 4         | 29   | 2-Wheel Drive, Rear
BMW          | BMW   | 430i xDrive Coupe       | 2            | 4         | 27   | All Wheel Drive
... (764 rows omitted)

In [12]:
cars.group('Brand')

Brand                    | count
ALFA ROMEO               | 4
Acura                    | 10
Aston Martin Lagonda Ltd | 6
Audi                     | 41
BMW                      | 76
Bentley                  | 4
Bugatti                  | 2
Buick                    | 8
Cadillac                 | 20
Chevrolet                | 27
... (31 rows omitted)

In [13]:
# shuffles the rows in the table; returns a new table
cars.shuffle()

Manufacturer        | Brand                    | Model                    | Displacement | Cylinders | MPG  | Wheel
Honda               | Honda                    | INSIGHT TOURING          | 1.5          | 4         | 48   | 2-Wheel Drive, Front
Volkswagen Group of | Audi                     | A5 Sportback quattro     | 2            | 4         | 28   | All Wheel Drive
Toyota              | TOYOTA                   | COROLLA APEX             | 2            | 4         | 34   | 2-Wheel Drive, Front
Ford Motor Company  | Ford                     | EXPEDITION 4WD           | 3.5          | 6         | 19   | Part-time 4-Wheel Drive
BMW                 | Mini                     | COOPER S COUNTRYMAN ALL4 | 2            | 4         | 26   | All Wheel Drive
General Motors      | Chevrolet                | COLORADO 2WD             | 2.5          | 4         | 22   | 2-Wheel Drive, Rear
Subaru              | Subaru                   | IMPREZA 5-Door           | 2            | 4         | 31   | All Wheel Drive
aston martin        | Aston Martin Lagonda Ltd | DBX V8                   | 4            | 8         | 15   | 4-Wheel Drive
Mercedes-Benz       | Mercedes-Benz            | GLC 300 4MATIC (Coupe)   | 2            | 4         | 24   | 4-Wheel Drive
Volkswagen Group of | Audi                     | A5 quattro               | 2            | 4         | 27   | All Wheel Drive
... (764 rows omitted)

In [14]:
cars.group('Brand')

Brand                    | count
ALFA ROMEO               | 4
Acura                    | 10
Aston Martin Lagonda Ltd | 6
Audi                     | 41
BMW                      | 76
Bentley                  | 4
Bugatti                  | 2
Buick                    | 8
Cadillac                 | 20
Chevrolet                | 27
... (31 rows omitted)

Note that it doesn't matter what order the rows are originally in. The resulting table will be sorted alphabetically.

### Specifying a `collect` function

We can also use `.group` to learn other aggregate statistics about cateogories. We do this by specifying a second argument: `collect`. The `collect` argument must be a function (e.g. `len`, `min` `np.mean`, etc).

In [15]:
gm.group('Brand', np.mean)

Brand     | Model mean | Cylinders mean | MPG mean
Buick     |            | 6              | 20.5
Cadillac  |            | 4.66667        | 24
Chevrolet |            | 4              | 24.6667
GMC       |            | 6              | 22

How does this work under the hood?

In [16]:
gm.where('Brand', 'Buick')

Brand | Model       | Cylinders | MPG
Buick | ENCLAVE FWD | 6         | 21
Buick | ENCLAVE AWD | 6         | 20

In [17]:
print('mean of Cylinders: ', gm.where('Brand', 'Buick').column('Cylinders').mean())
print('mean of MPG: ', gm.where('Brand', 'Buick').column('MPG').mean())

mean of Cylinders:  6.0
mean of MPG:  20.5

In [18]:
gm.where('Brand', 'Cadillac')

Brand    | Model        | Cylinders | MPG
Cadillac | CT4 AWD      | 4         | 26
Cadillac | XT5 AWD      | 4         | 23
Cadillac | ESCALADE 2WD | 6         | 23

In [19]:
print('mean of Cylinders: ', gm.where('Brand', 'Cadillac').column('Cylinders').mean())
print('mean of MPG: ', gm.where('Brand', 'Cadillac').column('MPG').mean())

mean of Cylinders:  4.66666666667
mean of MPG:  24.0

In [20]:
gm.where('Brand', 'Chevrolet')

Brand     | Model        | Cylinders | MPG
Chevrolet | CAMARO       | 4         | 25
Chevrolet | COLORADO 2WD | 4         | 22
Chevrolet | EQUINOX AWD  | 4         | 27

In [21]:
print('mean of Cylinders: ', gm.where('Brand', 'Chevrolet').column('Cylinders').mean())
print('mean of MPG: ', gm.where('Brand', 'Chevrolet').column('MPG').mean())

mean of Cylinders:  4.0
mean of MPG:  24.6666666667

In [22]:
gm.where('Brand', 'GMC')

Brand | Model        | Cylinders | MPG
GMC   | YUKON XL 4WD | 6         | 22

In [23]:
print('mean of Cylinders: ', gm.where('Brand', 'GMC').column('Cylinders').mean())
print('mean of MPG: ', gm.where('Brand', 'GMC').column('MPG').mean())

mean of Cylinders:  6.0
mean of MPG:  22.0

If you want a more concise way of doing the above:

In [25]:
# Just run this cell — you'll learn how to write for loops next week
for brand in np.unique(gm.column('Brand')):
    brand_only = gm.where('Brand', brand)
    print(brand)
    print('mean of Cylinders: ', brand_only.column('Cylinders').mean())
    print('mean of MPG: ', brand_only.column('MPG').mean())
    print('\n')

Buick
mean of Cylinders:  6.0
mean of MPG:  20.5


Cadillac
mean of Cylinders:  4.66666666667
mean of MPG:  24.0


Chevrolet
mean of Cylinders:  4.0
mean of MPG:  24.6666666667


GMC
mean of Cylinders:  6.0
mean of MPG:  22.0

What if we use other `collect` functions?

In [26]:
gm

Brand     | Model        | Cylinders | MPG
Buick     | ENCLAVE FWD  | 6         | 21
Cadillac  | CT4 AWD      | 4         | 26
Cadillac  | XT5 AWD      | 4         | 23
GMC       | YUKON XL 4WD | 6         | 22
Chevrolet | CAMARO       | 4         | 25
Chevrolet | COLORADO 2WD | 4         | 22
Cadillac  | ESCALADE 2WD | 6         | 23
Chevrolet | EQUINOX AWD  | 4         | 27
Buick     | ENCLAVE AWD  | 6         | 20

In [27]:
gm.group('Brand', sum)

Brand     | Model sum | Cylinders sum | MPG sum
Buick     |           | 12            | 41
Cadillac  |           | 14            | 72
Chevrolet |           | 12            | 74
GMC       |           | 6             | 22

In [28]:
gm.group('Brand', list)

Brand     | Model list                                | Cylinders list | MPG list
Buick     | ['ENCLAVE FWD', 'ENCLAVE AWD']            | [6, 6]         | [21, 20]
Cadillac  | ['CT4 AWD', 'XT5 AWD', 'ESCALADE 2WD']    | [4, 4, 6]      | [26, 23, 23]
Chevrolet | ['CAMARO', 'COLORADO 2WD', 'EQUINOX AWD'] | [4, 4, 4]      | [25, 22, 27]
GMC       | ['YUKON XL 4WD']                          | [6]            | [22]

In [29]:
gm.group('Brand', len)

Brand     | Model len | Cylinders len | MPG len
Buick     | 2         | 2             | 2
Cadillac  | 3         | 3             | 3
Chevrolet | 3         | 3             | 3
GMC       | 1         | 1             | 1

In [30]:
gm.group('Brand', max)

Brand     | Model max    | Cylinders max | MPG max
Buick     | ENCLAVE FWD  | 6             | 21
Cadillac  | XT5 AWD      | 6             | 26
Chevrolet | EQUINOX AWD  | 4             | 27
GMC       | YUKON XL 4WD | 6             | 22

### Grouping by Multiple Columns

We can also group by unique combinations of multiple variables. Passing in an array of column names as the first argument in `.group` will create a row for each unique combination of column values in the original table.

In [31]:
cars

Manufacturer | Brand | Model                   | Displacement | Cylinders | MPG  | Wheel
BMW          | BMW   | 228i Gran Coupe         | 2            | 4         | 28   | 2-Wheel Drive, Front
BMW          | BMW   | 228i xDrive Gran Coupe  | 2            | 4         | 27   | All Wheel Drive
BMW          | BMW   | 230i Convertible        | 2            | 4         | 27   | 2-Wheel Drive, Rear
BMW          | BMW   | 230i Coupe              | 2            | 4         | 28   | 2-Wheel Drive, Rear
BMW          | BMW   | 230i xDrive Convertible | 2            | 4         | 24   | All Wheel Drive
BMW          | BMW   | 230i xDrive Coupe       | 2            | 4         | 24   | All Wheel Drive
BMW          | BMW   | 330i                    | 2            | 4         | 30   | 2-Wheel Drive, Rear
BMW          | BMW   | 330i xDrive             | 2            | 4         | 28   | All Wheel Drive
BMW          | BMW   | 430i Coupe              | 2            | 4         | 29   | 2-Wheel Drive, Rear
BMW          | BMW   | 430i xDrive Coupe       | 2            | 4         | 27   | All Wheel Drive
... (764 rows omitted)

In [32]:
cars.group(['Manufacturer', 'Brand']).show()

In [33]:
cars.group(['Brand', 'Cylinders'], np.mean)

Brand                    | Cylinders | Manufacturer mean | Model mean | Displacement mean | MPG mean | Wheel mean
ALFA ROMEO               | 4         |                   |            | 2                 | 25.5     |
Acura                    | 4         |                   |            | 2.04444           | 24.4444  |
Acura                    | 6         |                   |            | 3.5               | 21       |
Aston Martin Lagonda Ltd | 8         |                   |            | 4                 | 18       |
Aston Martin Lagonda Ltd | 12        |                   |            | 5.2               | 17.5     |
Audi                     | 4         |                   |            | 2                 | 25.6875  |
Audi                     | 5         |                   |            | 2.5               | 24       |
Audi                     | 6         |                   |            | 2.97143           | 21.6429  |
Audi                     | 8         |                   |            | 4                 | 16.5     |
Audi                     | 10        |                   |            | 5.2               | 16.5     |
... (83 rows omitted)

In [41]:
cars.group('Cylinders', np.mean) \
    .where('Cylinders', 6) \
    .column("MPG mean")

array([ 21.55335968])

In [42]:
cars.group(['Manufacturer', 'Brand', 'Displacement'])

Manufacturer | Brand      | Displacement | count
BMW          | BMW        | 2            | 22
BMW          | BMW        | 3            | 34
BMW          | BMW        | 4.4          | 19
BMW          | BMW        | 6.6          | 1
BMW          | Mini       | 1.5          | 5
BMW          | Mini       | 2            | 12
BMW          | TOYOTA     | 2            | 1
BMW          | TOYOTA     | 3            | 1
FCA US LLC   | ALFA ROMEO | 2            | 4
FCA US LLC   | Chrysler   | 3.6          | 5
... (144 rows omitted)

## `.pivot`

Another useful table method is `tbl.pivot()`, which can help us determine statistics for different combinations of values for two variables.

For example, what if we wanted to view the mean MPG for each combination of car brand and cylinder number? `.pivot` allows us to do just that!

In [35]:
cars.pivot('Cylinders', 'Brand', 'MPG', np.mean)

Brand                    | 3    | 4       | 5    | 6       | 8       | 10   | 12   | 16
ALFA ROMEO               | 0    | 25.5    | 0    | 0       | 0       | 0    | 0    | 0
Acura                    | 0    | 24.4444 | 0    | 21      | 0       | 0    | 0    | 0
Aston Martin Lagonda Ltd | 0    | 0       | 0    | 0       | 18      | 0    | 17.5 | 0
Audi                     | 0    | 25.6875 | 24   | 21.6429 | 16.5    | 16.5 | 0    | 0
BMW                      | 0    | 26.8636 | 0    | 22.3529 | 17.4211 | 0    | 16   | 0
Bentley                  | 0    | 0       | 0    | 0       | 18.25   | 0    | 0    | 0
Bugatti                  | 0    | 0       | 0    | 0       | 0       | 0    | 0    | 10.5
Buick                    | 28.5 | 26      | 0    | 20.5    | 0       | 0    | 0    | 0
Cadillac                 | 0    | 23.5625 | 0    | 21.75   | 0       | 0    | 0    | 0
Chevrolet                | 28.5 | 25.5333 | 0    | 20      | 19      | 0    | 0    | 0
... (31 rows omitted)

`.pivot` can take up to four arguments, the last two of which are optional (but must be used together):
1. `columns`: The column in `tbl` to use as the columns in the pivot table
2. `rows`: The column in `tbl` to use as the rows in the pivot table
3. `values`: The column in `tbl` to aggregate using the `collect` function
4. `collect`: A function with which to aggregate the values in the `values` column

### Quick Check 2

<img src="pivot-table.png" width="70%"/>

Fill in the blanks to create the table above, which describes the largest number of cylinders each manufacturer makes for every possible drivetrain (`'Wheel'`).

In [ ]:
cars.pivot(___, ___, ___, ___) # Replace the blanks with your answers

## Demo: US R1 Universities

For our demo, we will be using a dataset of [R1 universities](https://en.wikipedia.org/wiki/List_of_research_universities_in_the_United_States) in the US.

In [ ]:
unis = Table.read_table("data/r1_with_students.csv")
unis

If we wanted to visualize information from this table, we could try to plot all 96 universities on one bar chart, but that isn't ideal...

In [ ]:
unis.sort('Number_students', descending=True).barh('University', 'Number_students')

Instead, let's group by state and find the average enrollment in each state.

In [ ]:
unis.group('State', np.mean).sort('Number_students mean', descending=True).barh('State', 'Number_students mean')

We can also use a pivot table to help us generate a useful visualization:

In [ ]:
unis_pivot = unis.pivot('Type', 'State')
unis_pivot

In [ ]:
unis_pivot.barh('State')

Ta-da!